![](https://snag.gy/h9Xwf1.jpg)

<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Introduction to `pandas`

_Authors: Tim Book_

---

`pandas` is the most popular python package for managing datasets and is used extensively by data scientists.

### Learning Objectives

- Define the anatomy of DataFrames.
- Explore data with DataFrames.
- Practice plotting with pandas.

### Lesson Guide

- What is `pandas`?
- Reading data
- Exploring data
    - Filtering
    - Sorting
- Split-Apply-Combine
- Missing Values

<a id='introduction'></a>

### What is `pandas`?

---

- Data analysis library - **Panel data system** (doesn't actually have to do with the animal, sorry).
- Created by Wes McKinney and Open Sourced by AQR Capital Management, LLC 2009.
- Implemented in highly optimized Python/Cython.
- Most ubiquitous tool used to start data analysis projects within the Python scientific ecosystem.

### Pandas Use Cases

---

- Cleaning data / Munging
- Exploratory Data Analysis (EDA)
- Structuring data for plots or tabular display
- Joining disparate sources
- Filtering, extracting, or transforming

## Importing the Dynamic Trio
From here on out, we'll begin pretty much all of our notebooks with the following three imports.

* **pandas**: The library we'll be using to do pretty much all data manipulation.
* **numpy**: The library we'll need to do various other computations. Even if you don't think you'll need it to start, you'll probably end up using it later.
* **matplotlib**: The library we'll use most for plotting. More on this another day.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Discussion: Where do you think a data scientist spends most of their time?

`/poll "Where do you think a data scientist spends most of their time?" "Moving data" "Cleaning data" "Exploring data" "Plotting data" "Predictive modeling" anonymous limit 1`

<a id='loading_csvs'></a>

### Loading a csv into a DataFrame

---

Pandas can load many types of files, but one of the most common filetypes for storing data is in a `.csv` file. Let's load a dataset on UFO sightings from the `./datasets` directory:

In [2]:
ufo = pd.read_csv('datasets/ufo.csv')

In [3]:
type(ufo)

pandas.core.frame.DataFrame

This creates a pandas object called a **DataFrame**. These are powerful containers for data with many built-in functions to explore and manipulate data.

We will barely scratch the surface of DataFrame functionality in this lesson, but over the course of this class you will become an expert at using them.

<a id='exploring_data'></a>

## Exploratory Data Analysis (EDA) with Python!

---

DataFrames come with built-in functionality that makes data exploration easy. 

Let's start by looking at the "head" of your data with the `.head()` built-in function. If run alone in a notebook cell, it will show you the first and last handful of columns and the first 5 rows.

In [4]:
ufo

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
80538,Neligh,NaN,CIRCLE,NE,9/4/2014 23:20
80539,Uhrichsville,NaN,LIGHT,OH,9/5/2014 1:14
80540,Tucson,RED BLUE,NaN,AZ,9/5/2014 2:40
80541,Orland park,RED,LIGHT,IL,9/5/2014 3:43
80542,Loughman,NaN,LIGHT,FL,9/5/2014 5:30

In [5]:
ufo.head(10)

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

If we want to see the last part of our data, we can equivalently use the ```.tail()``` function.

In [6]:
ufo.tail()

               City Colors Reported Shape Reported State            Time
80538        Neligh             NaN         CIRCLE    NE  9/4/2014 23:20
80539  Uhrichsville             NaN          LIGHT    OH   9/5/2014 1:14
80540        Tucson        RED BLUE            NaN    AZ   9/5/2014 2:40
80541   Orland park             RED          LIGHT    IL   9/5/2014 3:43
80542      Loughman             NaN          LIGHT    FL   9/5/2014 5:30

<a id='data_dimensions'></a>

### Data dimensions

---

It's good to look at what the dimensions of your data are. The ```.shape``` property will tell you the rows and colum counts of your DataFrame.

In [7]:
ufo.shape

(80543, 5)

In [8]:
rows, columns = ufo.shape
rows

80543

In [9]:
columns

5

`/poll "In terms of rows, is this the largest dataset you've ever worked with?" "Yes" "No" "Not sure, but I'm not impressed anyway" anonymous limit 1`

You will notice that this is operates the same as `.shape` for numpy arrays/matricies. Pandas makes use of numpy under the hood for optimization and speed.

Look at the names of your columns with the ```.columns``` property.

In [11]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [10]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [12]:
type(ufo.columns)

pandas.core.indexes.base.Index

Accessing a specific column is easy. You can use the bracket syntax just like python dictionaries with the string name of the column to extract that column.

In [66]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
80538                  Neligh
80539            Uhrichsville
80540                  Tucson
80541             Orland park
80542                Loughman
Name: City, Length: 80543, dtype: object

In [65]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [67]:
# Try to refrain from doing this...
# THREAD: Why shouldn't you rely on this? (There are several good reasons).
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
80538                  Neligh
80539            Uhrichsville
80540                  Tucson
80541             Orland park
80542                Loughman
Name: City, Length: 80543, dtype: object

As you can see we can also use the ```.head()``` function on a single column, which is represented as a pandas Series object.

You can also access a column (as a DataFrame instead of a Series) or multiple columns with a list of strings.

In [13]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
80538                  Neligh
80539            Uhrichsville
80540                  Tucson
80541             Orland park
80542                Loughman
Name: City, Length: 80543, dtype: object

In [14]:
ufo.loc[0, :]

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [15]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

<a id='dataframe_series'></a>

### DataFrame vs. Series

---

We've been playing with them, so I guess we should define them formally:

* A **`Series`** is a one-dimensional array of values **with an index**.
* A **`DataFrame`** is a two-dimensional array of values **with both a row and column index**.
* It turns out - each column of a `DataFrame` is actually a `Series`!

![](./assets/series-vs-df.png)

There is an important difference between using a list of strings and just a string with a column's name: when you use a list with the string it returns another **DataFrame**, but when you use just the string it returns a pandas **Series** object.

In [16]:
print(type(ufo['City']))
print(type(ufo[['City']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [17]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
80538                  Neligh
80539            Uhrichsville
80540                  Tucson
80541             Orland park
80542                Loughman
Name: City, Length: 80543, dtype: object

In [18]:
ufo[['City']]

                       City
0                    Ithaca
1               Willingboro
2                   Holyoke
3                   Abilene
4      New York Worlds Fair
...                     ...
80538                Neligh
80539          Uhrichsville
80540                Tucson
80541           Orland park
80542              Loughman

[80543 rows x 1 columns]

In [19]:
ufo.sort_values(by='City')

,City,Colors Reported,Shape Reported,State,Time
51832,((HOAX??)),NaN,CIRCLE,PA,1/20/2010 19:30
54735,((Unspecified location)),NaN,CHEVRON,IL,9/28/2010 19:30
76153,(City not specified),ORANGE,OTHER,MO,2/21/2014 19:45
53001,(above mountains in airplane),NaN,CIRCLE,UT,6/20/2010 15:00
76747,Abbeville,NaN,CIGAR,LA,3/31/2014 1:00
...,...,...,...,...,...
56676,NaN,NaN,SPHERE,VA,4/4/2011 18:00
60654,NaN,NaN,CYLINDER,PA,12/20/2011 12:00
72502,NaN,NaN,LIGHT,OH,9/12/2013 3:00
72503,NaN,NaN,OVAL,OH,9/12/2013 3:00
78525,NaN,RED,TRIANGLE,CA,6/25/2014 22:15

<a id='info'></a>

### Examining your data with `.info()`

---

The `.info()` should be the first thing you look at when getting acquainted with a new dataset.

**Types** are very important.  They impact the way data will be represented in our machine learning models, how data can be joined, whether or not math operators can be applied, and when you can encounter unexpected results.

> _Typical problems when working with new datasets_:
> - Missing values
> - Unexpected types (string/object instead of int/float)
> - Dirty data (commas, dollar signs, unexpected characters, etc)
> - Blank values that are actually "non-null" or single white-space characters

`.info()` is a function that is available on every **DataFrame** object. It gives you information about:

- Name of column / variable attribute
- Type of index (RangeIndex is default)
- Count of non-null values by column / attribute
- Type of data contained in column / attribute
- Unqiue counts of dtypes (Pandas data types)
- Memory usage of our dataset

In [20]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80543 entries, 0 to 80542
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             80496 non-null  object
 1   Colors Reported  17034 non-null  object
 2   Shape Reported   72141 non-null  object
 3   State            80543 non-null  object
 4   Time             80543 non-null  object
dtypes: object(5)
memory usage: 3.1+ MB

Note that the size of the dataset is listed at the bottom of the output of the info method.

## Aside:  Working with "Big Data"

---

The term **Big Data** has become a little bit of a buzzword with no clear, consensus definition. The most common definition is that **Big Data are data that are too big to fit in your computer's memory.**

![](https://snag.gy/UGNamo.jpg)

The reason that this definition is good is because when your data size exceeds your RAM, you have to use a separate set of tools to solve your problems. For example:

* Spark (Week 7!)
* Hadoop
* Being clever with how you read and use data
    - Separate it into small chunks for example.

<a id='describe'></a>

## Quick Summaries

---

The `.describe()` function is very useful for taking a quick look at your data. It gives you some of the basic descriptive statistics.

You can use `.value_counts()` to get a good tabular view of a categorical variable.

In [21]:
# Let's read in the diamonds data set.
diamonds = pd.read_csv('datasets/diamonds.csv')
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [22]:
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    53940 non-null  float64
 1   cut      53940 non-null  object
 2   color    53940 non-null  object
 3   clarity  53940 non-null  object
 4   depth    53940 non-null  float64
 5   table    53940 non-null  float64
 6   price    53940 non-null  int64
 7   x        53940 non-null  float64
 8   y        53940 non-null  float64
 9   z        53940 non-null  float64
dtypes: float64(6), int64(1), object(3)
memory usage: 4.1+ MB

In [23]:
# Let's describe the price
diamonds['price'].describe()

count    53940.000000
mean      3932.799722
std       3989.439738
min        326.000000
25%        950.000000
50%       2401.000000
75%       5324.250000
max      18823.000000
Name: price, dtype: float64

We can even do it to the whole DataFrame - what does that look like?
What's missing?

In [24]:
diamonds.describe()

,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [27]:
# Let's count up the cuts
cut_counts = diamonds['cut'].value_counts() # ['cut'] makes a series. 
# value_counts makes a shorter series indexed by unique values.
print(type(cut_counts)) 
cut_counts

<class 'pandas.core.series.Series'>

Ideal        21551
Premium      13791
Very Good    12082
Good          4906
Fair          1610
Name: cut, dtype: int64

In [29]:
# Evaluate a series at an index value.
cut_counts['Very Good']

12082

In [30]:
# Let's do the same thing, but normalized
cut_percentages = diamonds['cut'].value_counts(normalize=True)
cut_percentages

Ideal        0.399537
Premium      0.255673
Very Good    0.223990
Good         0.090953
Fair         0.029848
Name: cut, dtype: float64

In [31]:
cut_percentages.sum()

1.0

In [84]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

```.describe()``` gives us these statistics:

- **count**, which is equivalent to the number of cells (rows)
- **mean**, the average of the values in the column
- **std**, which is the standard deviation
- **min**, the minimum value
- **25%**, the 25th percentile of the values 
- **50%**, the 50th percentile of the values, which is the equivalent to the median
- **75%**, the 75th percentile of the values
- **max**, the maximum value

There are built-in math functions that will work on all of the columns of a DataFrame at once, or subsets of the data.

I can use the `.mean()` function on the `diamonds` DataFrame to get the mean for every **numeric** column.

In [43]:
diamonds[['x','y','z']].mean()

x    5.731157
y    5.734526
z    3.538734
dtype: float64

But not for categorical columns.

In [48]:
try:
    diamonds.mean(numeric_only = False)
except:
    print("see, it doesn't work")

see, it doesn't work

You can tell the method to only look at numeric values. That includes floats and integers.

In [45]:
diamonds.mean(numeric_only = True)

carat       0.797940
depth      61.749405
table      57.457184
price    3932.799722
x           5.731157
y           5.734526
z           3.538734
dtype: float64

In [51]:
diamonds[["price"]].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   price   53940 non-null  int64
dtypes: int64(1)
memory usage: 421.5 KB

<a id='independent_practice'></a>

### Now you!

---

Now that we know a little bit about basic DataFrame use, let's practice on a new dataset.

> Pro tip:  You can use the "tab" key to browse filesystem resources when your cursor is in a string to get a relative reference to the files that can be loaded in Jupyter notebook.  Remember, you have to use your arrow keys to navigate the files populated in the UI. 

<img src="https://snag.gy/IlLNm9.jpg">

1. Read in the `cars.csv` dataset. (call it `cars`)
1. What is the mean `mpg` for cars in this dataset?

In [52]:
cars = pd.read_csv('datasets/cars.csv')
cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [53]:
cars['mpg'].mean()

20.090624999999996

In [54]:
cars.mean()['mpg']

20.090624999999996

## Filtering
We usually don't need to operate on the _whole_ dataset. A very common task is to parse it down to only the pieces we need.

### Filters for NumPy

In [57]:
v = np.array([12, 98, 9, 50, 23])
our_filter = np.array([True, False, True, False, True])

# What do you think the result of this cell is?
v[our_filter]

array([12,  9, 23])

In [92]:
# How about this?
v < 40

array([ True, False,  True, False,  True])

In [93]:
# So...
v[v < 40]

array([12,  9, 23])

### Filters for Pandas

In [60]:
mpg_filter = cars['mpg'] > 30

cars[mpg_filter]

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2

Filtering in pandas uses vectors of booleans to describe inclusion or exclusion. `True` means you're in, `False` means you're out.

In [61]:
# Give me every diamond with "Ideal" cut.
is_ideal = diamonds['cut'] == 'Ideal'
is_ideal

0         True
1        False
2        False
3        False
4        False
         ...
53935     True
53936    False
53937    False
53938    False
53939     True
Name: cut, Length: 53940, dtype: bool

In [62]:
diamonds[is_ideal]

       carat    cut color clarity  depth  table  price     x     y     z
0       0.23  Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
11      0.23  Ideal     J     VS1   62.8   56.0    340  3.93  3.90  2.46
13      0.31  Ideal     J     SI2   62.2   54.0    344  4.35  4.37  2.71
16      0.30  Ideal     I     SI2   62.0   54.0    348  4.31  4.34  2.68
39      0.33  Ideal     I     SI2   61.8   55.0    403  4.49  4.51  2.78
...      ...    ...   ...     ...    ...    ...    ...   ...   ...   ...
53925   0.79  Ideal     I     SI1   61.6   56.0   2756  5.95  5.97  3.67
53926   0.71  Ideal     E     SI1   61.9   56.0   2756  5.71  5.73  3.54
53929   0.71  Ideal     G     VS1   61.4   56.0   2756  5.76  5.73  3.53
53935   0.72  Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53939   0.75  Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[21551 rows x 10 columns]

In [98]:
# Every 4 cylinder (cyl) car
cars[cars['cyl'] == 4]

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

Variables that serve this function are sometimes called "masks".

### Multiple Filters
Often we want to filter based on multiple conditions. We can use the usual "and" and "or" logic, but the symbols change for mystical (read: annoying) Python reasons.

In [100]:
# "And" logic - use ampersand (&)
# Note parentheses mandatory!
diamonds[(diamonds['cut'] == 'Ideal') & (diamonds['color'] == 'J')]

       carat    cut color clarity  depth  table  price     x     y     z
11      0.23  Ideal     J     VS1   62.8   56.0    340  3.93  3.90  2.46
13      0.31  Ideal     J     SI2   62.2   54.0    344  4.35  4.37  2.71
41      0.33  Ideal     J     SI1   61.1   56.0    403  4.49  4.55  2.76
460     0.90  Ideal     J     VS2   62.8   55.0   2817  6.20  6.16  3.88
681     0.75  Ideal     J     SI1   61.5   56.0   2850  5.83  5.87  3.60
...      ...    ...   ...     ...    ...    ...    ...   ...   ...   ...
53598   0.71  Ideal     J     SI1   60.6   57.0   2700  5.78  5.83  3.52
53666   0.81  Ideal     J     VS2   62.1   56.0   2708  5.92  5.97  3.69
53670   0.84  Ideal     J     VS2   61.1   57.0   2709  6.09  6.12  3.73
53848   0.82  Ideal     J     VS2   61.6   56.0   2741  6.00  6.04  3.71
53852   0.83  Ideal     J     VS2   62.3   55.0   2742  6.01  6.03  3.75

[896 rows x 10 columns]

In [101]:
# "Or" logic - use pipe (|)
# Either Ideal cut or over $2,000
diamonds[(diamonds['cut'] == 'Ideal') | (diamonds['price'] > 2_000)]

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
11      0.23      Ideal     J     VS1   62.8   56.0    340  3.93  3.90  2.46
13      0.31      Ideal     J     SI2   62.2   54.0    344  4.35  4.37  2.71
16      0.30      Ideal     I     SI2   62.0   54.0    348  4.31  4.34  2.68
39      0.33      Ideal     I     SI2   61.8   55.0    403  4.49  4.51  2.78
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[41335 rows x 10 columns]

### Now you:

In [63]:
# (THREAD): Show me all the UFO sightings in your hometown! (City and State)
# Anything interesting?
ufo[(ufo['City'] == 'Denver') & (ufo['State'] == 'CO')]

         City    Colors Reported Shape Reported State             Time
309    Denver                NaN       FIREBALL    CO  11/1/1954 18:30
431    Denver                NaN          LIGHT    CO  7/15/1957 22:00
750    Denver                NaN           DISK    CO  8/15/1962 17:30
1928   Denver  ORANGE GREEN BLUE          CIGAR    CO  1/24/1970 20:15
2476   Denver                NaN       TRIANGLE    CO   8/6/1973 22:00
...       ...                ...            ...   ...              ...
78807  Denver             ORANGE         SPHERE    CO   7/4/2014 21:30
78858  Denver                NaN           DISK    CO   7/4/2014 22:00
79320  Denver                NaN            NaN    CO  7/15/2014 21:45
79321  Denver                NaN          LIGHT    CO  7/15/2014 21:45
79726  Denver             ORANGE           OVAL    CO   8/2/2014 22:45

[208 rows x 5 columns]

### Aside: Some shortcuts

For filtering with nultiple inequalities, use `between`.

In [65]:
cars['mpg'].between(24, 30).head()

0    False
1    False
2    False
3    False
4    False
Name: mpg, dtype: bool

Tilde is for negation.

In [104]:
cars[~cars['mpg'].between(14, 31)]

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4

For filtering by inclusion in a set, there is an `isin` method.

In [68]:
ufo['City'].isin(['Ithaca', 'Willingboro'])

0         True
1         True
2        False
3        False
4        False
         ...
80538    False
80539    False
80540    False
80541    False
80542    False
Name: City, Length: 80543, dtype: bool

<a id='indexing'></a>

## Pandas Indexing: `.loc` and `.iloc`

---

So far we've learned how to select both rows and columns. The savvy and skeptical student would have noticed a problem here. We have ambiguous notation! What does this do:

```python
data[something]
```

We can't tell! Is `something` a mask or a string? One selects rows, the other selects columns. **What if we wanted to filter rows and select columns at the same time?!**

Pandas has two properties that you can use for indexing:

- **`.loc`** indexes with the _labels_ for rows and columns axis.
- **`.iloc`** indexes with the _integer positions_ for rows and columns axis.
> There used to be a third, `.ix` which is now deprecated and shan't ever be used again.

## `.loc` is Most Common
The syntax of `.loc` is pretty intuitive:

```python
data.loc[rows, columns]
```

Where `rows` is often a filter (ie, a **mask**), and `columns` is a list of columns, or even just `:` to select all columns.

In [71]:
row_filter = cars['mpg'] > 30
columns = ['mpg', 'cyl']
cars.loc[row_filter, columns ]

     mpg  cyl
17  32.4    4
18  30.4    4
19  33.9    4
27  30.4    4

In [70]:
rows = [17, 18, 19, 27]
columns = ['mpg', 'cyl']
cars.loc[rows, columns]

     mpg  cyl
17  32.4    4
18  30.4    4
19  33.9    4
27  30.4    4

Colon alone means all.

In [108]:
cars.loc[:, :]

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

For a limited slice, loc does not work.

In [75]:
try: 
    cars.loc[:5, :5]
except:
    print("Doesn't work")

Doesn't work

### `.iloc` is rare, but useful
The `i` stands for "integer" and will give you the actual zero-indexed numerical indices.

In [79]:
# First and second row,
# second, third, and fourth column, regardless of their name.
cars.iloc[1:3, 2:5]

    disp   hp  drat
1  160.0  110  3.90
2  108.0   93  3.85

So, `df[column]` is just shorthand.

In [93]:
np.alltrue(cars['hp'] == cars.loc[:,'hp'])

True

In [94]:
np.alltrue(cars['hp'] == cars.iloc[:,3])

True

### Acccctually.....
![](assets/actually.png)

According to **_The Zen of Python_**, explicit is better than implicit. `.loc` is explicit. **Most people choose to always use `.loc` instead of the ambiguous `data[something]` notation! This is a pretty good idea! When in doubt, use `.loc`!**

## Sorting

In [95]:
# We can sort individual Series.
# The index from the original ordering appears with the worted values. 
cars['mpg'].sort_values(ascending=False).head()

19    33.9
17    32.4
27    30.4
18    30.4
25    27.3
Name: mpg, dtype: float64

In [96]:
# Or of a DataFrame by a column/feature.
cars.sort_values('mpg', ascending=False).head()

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
25  27.3    4  79.0   66  4.08  1.935  18.90   1   1     4     1

### Sorting on multiple columns

If the argument passed to the parameter `by` is a list, then the first thing is sorted upon first.

In [101]:
cars.sort_values(by=['cyl', 'mpg'], ascending=[False, True])[[ 'cyl','mpg']].iloc[10:18,:]

    cyl   mpg
11    8  16.4
12    8  17.3
4     8  18.7
24    8  19.2
10    6  17.8
5     6  18.1
9     6  19.2
29    6  19.7

Filtering and sorting together are powerful.

In [102]:
cars[cars['cyl'] == 4].sort_values('mpg')

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1

### Now You:

In [115]:
ufo.Time = pd.to_datetime(ufo.Time)

In [116]:
# Give me the 5 most recent UFO sightings in Roswell, New Mexico.
# You'll need to filter and use .sort_values()
# This is a hard one!

## Split-Apply-Combine

---

What if we want summary statistics _with respect to some categorical variable?_ For example, the price of a diamond probably varies widely between different diamond cuts. To tackle this problem, we'll use the **Split-Apply-Combine** technique. (This is sometimes called **MapReduce**, but is more of a special case of MapReduce). 

* **Split**: Separate your data into different DataFrames, one for each category.
* **Apply**: On each split-up DataFrame, apply some function or transformation (for example, the mean).
* **Combine**: Take the results and combine the split-up DataFrames back into one aggregate DataFrame.

This might sound complicated, but it's actually only two commands in pandas (the **Combine** step is done for us).

In [123]:
# Split into one ... series... for each value of 'cut'.
diamonds.groupby('cut')

In [128]:
# Apply the mean to each numeric feature for each value of cut.
# This combines the dfs into one df.
print(type(diamonds.groupby('cut').mean()))
diamonds.groupby('cut').mean()

<class 'pandas.core.frame.DataFrame'>

,carat,depth,table,price,x,y,z
cut,,,,,,,
Fair,1.046137,64.041677,59.053789,4358.757764,6.246894,6.182652,3.982770
Good,0.849185,62.365879,58.694639,3928.864452,5.838785,5.850744,3.639507
Ideal,0.702837,61.709401,55.951668,3457.541970,5.507451,5.520080,3.401448
Premium,0.891955,61.264673,58.746095,4584.257704,5.973887,5.944879,3.647124
Very Good,0.806381,61.818275,57.956150,3981.759891,5.740696,5.770026,3.559801

In [126]:
# What is the mean price by diamond cut?
diamonds.groupby('cut').mean().loc['Ideal', 'price']

3457.541970210199

We can  describe each feature by cut.

In [ ]:
diamonds.groupby('cut').describe()

             carat                                                      depth  \
             count      mean       std   min   25%   50%   75%   max    count
cut
Fair        1610.0  1.046137  0.516404  0.22  0.70  1.00  1.20  5.01   1610.0
Good        4906.0  0.849185  0.454054  0.23  0.50  0.82  1.01  3.01   4906.0
Ideal      21551.0  0.702837  0.432876  0.20  0.35  0.54  1.01  3.50  21551.0
Premium    13791.0  0.891955  0.515262  0.20  0.41  0.86  1.20  4.01  13791.0
Very Good  12082.0  0.806381  0.459435  0.20  0.41  0.71  1.02  4.00  12082.0

                      ...      y               z                           \
                mean  ...    75%    max    count      mean       std  min
cut                   ...
Fair       64.041677  ...  6.640  10.54   1610.0  3.982770  0.651638  0.0
Good       62.365879  ...  6.440   9.38   4906.0  3.639507  0.654893  0.0
Ideal      61.709401  ...  6.445  31.80  21551.0  3.401448  0.657648  0.0
Premium    61.264673  ...  6.760  58.90  13791.0  3.647124  0.731161  0.0
Very Good  61.818275  ...  6.510   9.94  12082.0  3.559801  0.730228  0.0


            25%   50%   75%    max
cut
Fair       3.61  3.97  4.28   6.98
Good       3.07  3.70  4.03   5.79
Ideal      2.80  3.23  3.98   6.03
Premium    2.94  3.72  4.16   8.06
Very Good  2.95  3.56  4.02  31.80

[5 rows x 56 columns]

### Aggregating over multiple functions
The `.agg` method allows this. The functions can be custom, or from python libraries, or from default python, or from strings that Pandas knows.

In [138]:
# A custom function.
def quantile_99(v):
    return v.quantile(q=0.99)
quantile_99(diamonds['x'])

8.36

In [139]:

groupby_cut = diamonds.groupby('cut')
# You can put in strings or functions: max here is a function.
groupby_cut.agg(['sum',np.sum,min, quantile_99,'mean', 'count'])

/Users/wonderman/miniforge3/envs/gadsi/lib/python3.9/site-packages/pandas/core/groupby/generic.py:303: FutureWarning: Dropping invalid columns in SeriesGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the aggregating function.
  results[key] = self.aggregate(func)

              carat                                                   depth  \
                sum       sum   min quantile_99      mean  count        sum
cut
Fair        1684.28   1684.28  0.22      2.5291  1.046137   1610   103107.1
Good        4166.10   4166.10  0.23      2.1000  0.849185   4906   305967.0
Ideal      15146.84  15146.84  0.20      2.1000  0.702837  21551  1329899.3
Premium    12300.95  12300.95  0.20      2.2710  0.891955  13791   844901.1
Very Good   9742.70   9742.70  0.20      2.1100  0.806381  12082   746888.4

                                        ...    y                               \
                 sum   min quantile_99  ...  min quantile_99      mean  count
cut                                     ...
Fair        103107.1  43.0      70.591  ...  0.0      8.5955  6.182652   1610
Good        305967.0  54.3      65.195  ...  0.0      8.3000  5.850744   4906
Ideal      1329899.3  43.0      63.000  ...  0.0      8.2300  5.520080  21551
Premium     844901.1  58.0      63.000  ...  0.0      8.4300  5.944879  13791
Very Good   746888.4  56.8      63.900  ...  0.0      8.2900  5.770026  12082

                  z
                sum       sum  min quantile_99      mean  count
cut
Fair        6412.26   6412.26  0.0      5.5791  3.982770   1610
Good       17855.42  17855.42  0.0      5.1400  3.639507   4906
Ideal      73304.61  73304.61  0.0      5.0900  3.401448  21551
Premium    50297.49  50297.49  0.0      5.1900  3.647124  13791
Very Good  43009.52  43009.52  0.0      5.0900  3.559801  12082

[5 rows x 42 columns]

### Now You:
What is the mean miles per gallon for each cylinder size?

In [135]:
cars.groupby('cyl')['mpg'].mean()

cyl
4    26.663636
6    19.742857
8    15.100000
Name: mpg, dtype: float64

In [141]:
# This applies mean to all columns, then picks out 'mpg'.
# Therefore, it is inefficient. 
cars.groupby('cyl').mean()['mpg']

cyl
4    26.663636
6    19.742857
8    15.100000
Name: mpg, dtype: float64

### Advanced Split-Apply-Combining
Feel free to skip!

In [142]:
# What if I want my own home-spun aggregate function?

# Maybe the mean of the log-price is interesting to you?
def mean_log(p):
    return np.mean(np.log(p))

diamonds.groupby('cut')['price'].agg(['count', 'mean', mean_log])

           count         mean  mean_log
cut
Fair        1610  4358.757764  8.093441
Good        4906  3928.864452  7.842809
Ideal      21551  3457.541970  7.639467
Premium    13791  4584.257704  7.950795
Very Good  12082  3981.759891  7.798664

In [148]:
# What if I want functions of different columns?
groupby_cut.agg({
    'price': 
        ['count', 'mean'],
        # {'count': 'count', 'price_mean': 'mean'}, # uses depricated nested renamer.
    'carat': 
        ['max','mean']
})

           price              carat
           count         mean   max      mean
cut
Fair        1610  4358.757764  5.01  1.046137
Good        4906  3928.864452  3.01  0.849185
Ideal      21551  3457.541970  3.50  0.702837
Premium    13791  4584.257704  4.01  0.891955
Very Good  12082  3981.759891  4.00  0.806381

## Adding, Dropping, Renaming, and `inplace` Methods

In [142]:
# Adding a column is easy, just define it!
# What if I wanted km per gal instead of miles per gal?
cars['kmpg'] = cars['mpg'] * 1.609
cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb     kmpg
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4  33.7890
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4  33.7890
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1  36.6852
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1  34.4326
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2  30.0883

In [143]:
cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb     kmpg
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4  33.7890
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4  33.7890
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1  36.6852
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1  34.4326
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2  30.0883

In [147]:
# Oops - that actually doesn't make sense since they'd be using liters anyway.
# Let's drop it.
cars.drop(columns='kmpg', inplace=True)

In [148]:
# But... it's not gone?
cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

###  Inplace Methods!
There are several methods in pandas that don't "stick" unless you tell them to. These methods will always have `inplace=False` by default. If you want to run a method and have it "stick" - assign `inplace=True`.

For example...

### Renaming Columns

In [151]:
# Yuck - I hate spaces and capital letters
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [152]:
# Lowercaseifying is easy:
# The "columns" attribute of a DataFrame works just like a numpy array or Series.
ufo.columns = ufo.columns.str.lower()
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [153]:
# The .rename method
new_names ={'colors reported': 'colors', 'shape reported': 'shape'}
ufo.rename(columns=new_names, inplace=True)

In [154]:
ufo.head()

                   city colors     shape state             time
0                Ithaca    NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro    NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke    NaN      OVAL    CO  2/15/1931 14:00
3               Abilene    NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     LIGHT    NY  4/18/1933 19:00

### Transform

Dewa added this section.

The transform method on a `groupby` object gives a value for each row that depends on the category of that row.

In [201]:
diamonds.groupby("cut").transform("mean")

/var/folders/kl/2yh74fss7jj3r6_9sk1_4fmm0000gn/T/ipykernel_205/745972102.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the transforming function.
  diamonds.groupby("cut").transform("mean")

,carat,depth,table,price,x,y,z
0,0.702837,61.709401,55.951668,3457.541970,5.507451,5.520080,3.401448
1,0.891955,61.264673,58.746095,4584.257704,5.973887,5.944879,3.647124
2,0.849185,62.365879,58.694639,3928.864452,5.838785,5.850744,3.639507
3,0.891955,61.264673,58.746095,4584.257704,5.973887,5.944879,3.647124
4,0.849185,62.365879,58.694639,3928.864452,5.838785,5.850744,3.639507
...,...,...,...,...,...,...,...
53935,0.702837,61.709401,55.951668,3457.541970,5.507451,5.520080,3.401448
53936,0.849185,62.365879,58.694639,3928.864452,5.838785,5.850744,3.639507
53937,0.806381,61.818275,57.956150,3981.759891,5.740696,5.770026,3.559801
53938,0.891955,61.264673,58.746095,4584.257704,5.973887,5.944879,3.647124
53939,0.702837,61.709401,55.951668,3457.541970,5.507451,5.520080,3.401448

In [200]:
diamonds.groupby("cut")[['x','y','z']].transform("mean")

              x         y         z
0      5.507451  5.520080  3.401448
1      5.973887  5.944879  3.647124
2      5.838785  5.850744  3.639507
3      5.973887  5.944879  3.647124
4      5.838785  5.850744  3.639507
...         ...       ...       ...
53935  5.507451  5.520080  3.401448
53936  5.838785  5.850744  3.639507
53937  5.740696  5.770026  3.559801
53938  5.973887  5.944879  3.647124
53939  5.507451  5.520080  3.401448

[53940 rows x 3 columns]

### Aside: `str` and `dt` methods
There are a lot of familiar string and date operations we can perform on columns. Strangely, they exist within a pandas submodule and so have to be prefixed with `str` and `dt` respectively.

In [155]:
ufo['shape'] = ufo['shape'].str.lower()
ufo.head()

                   city colors     shape state             time
0                Ithaca    NaN  triangle    NY   6/1/1930 22:00
1           Willingboro    NaN     other    NJ  6/30/1930 20:00
2               Holyoke    NaN      oval    CO  2/15/1931 14:00
3               Abilene    NaN      disk    KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     light    NY  4/18/1933 19:00

In [156]:
ufo['state'].str.lower().head()

0    ny
1    nj
2    co
3    ks
4    ny
Name: state, dtype: object

In [170]:
ufo['shape'].str.replace('O', 'BRO').head()

0    TRIANGLE
1     BROTHER
2      BROVAL
3        DISK
4       LIGHT
Name: shape, dtype: object

In [171]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80543 entries, 0 to 80542
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    80496 non-null  object
 1   colors  17034 non-null  object
 2   shape   72141 non-null  object
 3   state   80543 non-null  object
 4   time    80543 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 3.1+ MB

In [175]:
# We already did this above, but datetime variables need to be converted specially.
# ufo['time'] = pd.to_datetime(ufo['time'])
ufo['time'].dt.year

0        1930
1        1930
2        1931
3        1931
4        1933
         ...
80538    2014
80539    2014
80540    2014
80541    2014
80542    2014
Name: time, Length: 80543, dtype: int64

## Missing Values

In [176]:
ufo.head()

                   city colors     shape state                time
0                Ithaca    NaN  TRIANGLE    NY 1930-06-01 22:00:00
1           Willingboro    NaN     OTHER    NJ 1930-06-30 20:00:00
2               Holyoke    NaN      OVAL    CO 1931-02-15 14:00:00
3               Abilene    NaN      DISK    KS 1931-06-01 13:00:00
4  New York Worlds Fair    NaN     LIGHT    NY 1933-04-18 19:00:00

In [157]:
s = pd.Series([5, 7, np.nan, 2, 10])
s

0     5.0
1     7.0
2     NaN
3     2.0
4    10.0
dtype: float64

In [158]:
# Hmm...
s.isnull().sum()

1

In [193]:
# How many missing values for diamonds
diamonds.isnull().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [200]:
ufo.isnull().mean()

city      0.000584
colors    0.788510
shape     0.104317
state     0.000000
time      0.000000
dtype: float64

In [160]:
# Easy way to filter out missings!
notnull_color = ufo['colors'].notnull()
ufo[notnull_color].head()

          city colors      shape state             time
12      Belton    RED     sphere    SC  6/30/1939 20:00
19  Bering Sea    RED      other    AK  4/30/1943 23:00
36  Portsmouth    RED  formation    VA   7/10/1945 1:30
44   Blairsden  GREEN     sphere    CA  6/30/1946 19:00
66     Wexford   BLUE        NaN    PA   7/1/1947 20:00

## Exporting Data
We can read data, but how do we save it so we can send it out? pandas has several methods of the form `.to_*()`.

In [161]:
ufo.head()

                   city colors     shape state             time
0                Ithaca    NaN  triangle    NY   6/1/1930 22:00
1           Willingboro    NaN     other    NJ  6/30/1930 20:00
2               Holyoke    NaN      oval    CO  2/15/1931 14:00
3               Abilene    NaN      disk    KS   6/1/1931 13:00
4  New York Worlds Fair    NaN     light    NY  4/18/1933 19:00

In [162]:
ufo.to_csv('datasets/foobar.csv', index=False)

In [212]:
foo = pd.read_csv('datasets/foobar.csv')
foo.head()

                   city colors     shape state                 time
0                Ithaca    NaN  triangle    NY  1930-06-01 22:00:00
1           Willingboro    NaN     other    NJ  1930-06-30 20:00:00
2               Holyoke    NaN      oval    CO  1931-02-15 14:00:00
3               Abilene    NaN      disk    KS  1931-06-01 13:00:00
4  New York Worlds Fair    NaN     light    NY  1933-04-18 19:00:00

<a id='review'></a>

### Review

---

 - What would we do with a dataset when we first acquire it?
 - What's important to consider when first looking at a dataset? 
 - What are some common problems we can run into with new data?
 - What are some common operations with DataFrames?
 - How do we slice? Index? Filter?

# EXTRA MATERIALS
![](assets/biohazard.png)

Everything that follows is considered advanced or "too much" for our first session with pandas, and may not be explicitly covered by the instructor. If the instructor _does_ cover it, please don't worry that you don't understand this on your first pass.

**THAT DOES NOT MEAN THESE TOPICS ARE UNIMPORTANT OR RARELY USED!** We highly _highly_ recommend you take a look at these on your own time.

### Merging

When two DataFrames share a feature, you can merge the dataframes on that feature.

In [163]:
movies = pd.read_csv(
    'datasets/movies.tbl',
    sep='|',
    encoding='latin1',
    header=None,
    names=['movie_id', 'title'],
    usecols=[0, 1]
)
movies.rename(columns={'movie_id': 'the_movie_id'}, inplace=True)
movies.head()

   the_movie_id              title
0             1   Toy Story (1995)
1             2   GoldenEye (1995)
2             3  Four Rooms (1995)
3             4  Get Shorty (1995)
4             5     Copycat (1995)

In [166]:
ratings = pd.read_csv(
    'datasets/movie_ratings.tsv',
    sep='\t',
    header=None,
    names=['user_id', 'movie_id', 'rating', 'timestamp']
)
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [169]:
movie_reviews = pd.merge(ratings, movies, 
                         left_on='movie_id', right_on='the_movie_id', 
                         how='left' # Options are inner, outer, left, and right.
                        )
movie_reviews.head()

,user_id,movie_id,rating,timestamp,the_movie_id,title
0,196,242,3,881250949,242,Kolya (1996)
1,186,302,3,891717742,302,L.A. Confidential (1997)
2,22,377,1,878887116,377,Heavyweights (1994)
3,244,51,2,880606923,51,Legends of the Fall (1994)
4,166,346,1,886397596,346,Jackie Brown (1997)

In [173]:
movie_reviews = pd.merge(ratings, movies, 
                         left_on='movie_id', right_on='the_movie_id', 
                         how='right' # Options are inner, outer, left, and right.
                        )
movie_reviews.head()

   user_id  movie_id  rating  timestamp  the_movie_id             title
0      308         1       4  887736532             1  Toy Story (1995)
1      287         1       5  875334088             1  Toy Story (1995)
2      148         1       4  877019411             1  Toy Story (1995)
3      280         1       4  891700426             1  Toy Story (1995)
4       66         1       3  883601324             1  Toy Story (1995)

In [217]:
print(movies.shape)
print(ratings.shape)
print(movie_reviews.shape)

(1682, 2)
(100000, 4)
(100000, 5)

### "Categorical" Variables
Despite the name, when pandas says "Categorical", they really mean "Ordinal" - that is, ordered categories.

For example, check out the following crosstab:

In [174]:
# crosstab gives a frequency table of the factors 
# unless an array of values and an aggregation function are passed.
pd.crosstab(diamonds['cut'], diamonds['color'])

color         D     E     F     G     H     I    J
cut
Fair        163   224   312   314   303   175  119
Good        662   933   909   871   702   522  307
Ideal      2834  3903  3826  4884  3115  2093  896
Premium    1603  2337  2331  2924  2360  1428  808
Very Good  1513  2400  2164  2299  1824  1204  678

The "cuts" are not in the right order! They're actually in alphabetical order. We can fix this by telling pandas that there really is an important ordering here.

In [175]:
diamonds['cut'] = pd.Categorical(
    values=diamonds['cut'], 
    categories=['Fair', 'Good', 'Very Good', 'Premium', 'Ideal'])
pd.crosstab(diamonds['cut'], diamonds['color'])

color         D     E     F     G     H     I    J
cut
Fair        163   224   312   314   303   175  119
Good        662   933   909   871   702   522  307
Very Good  1513  2400  2164  2299  1824  1204  678
Premium    1603  2337  2331  2924  2360  1428  808
Ideal      2834  3903  3826  4884  3115  2093  896

### Categorizing with `.map()`

In [228]:
cars['cyl_word'] = cars['cyl'].map({6: 'Six', 4: 'Four', 8: 'Eight'})

In [229]:
cars['cyl_word'] = cars['cyl'].map({4: 'Four', 6: 'Six', 8: 'Eight'})
cars['cyl_word'].value_counts()

Eight    14
Four     11
Six       7
Name: cyl_word, dtype: int64

In [234]:
def is_efficient(mpg):
    if mpg > 20:
        return "Efficient"
    else:
        return "Wasteful"
    
cars['fuel_economy'] = cars['mpg'].map(is_efficient)
cars['fuel_economy'].value_counts()

Wasteful     18
Efficient    14
Name: fuel_economy, dtype: int64

### Advanced Data Manipulation with `.apply()`
The `.apply()` method is very similar to `.map()`, except more advanced. You can apply a function along any axis of a `DataFrame`. `.apply()` is our "Swiss army knife" for data manipulation - if something can't be solved with ordinary means, it might be time for a `.apply()`.

In [251]:
diamonds['price'] / diamonds['carat']

0        1417.391304
1        1552.380952
2        1421.739130
3        1151.724138
4        1080.645161
            ...
53935    3829.166667
53936    3829.166667
53937    3938.571429
53938    3205.813953
53939    3676.000000
Length: 53940, dtype: float64

In [236]:
def price_per_carat(row):
    return row['price'] / row['carat']

In [238]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [237]:
diamonds.apply(price_per_carat, axis=1)

0        1417.391304
1        1552.380952
2        1421.739130
3        1151.724138
4        1080.645161
            ...
53935    3829.166667
53936    3829.166667
53937    3938.571429
53938    3205.813953
53939    3676.000000
Length: 53940, dtype: float64

In [239]:
sizes = pd.Series([8, 4, 5, 'L', 2, 12, 16, 8, 'XL'])
sizes

0     8
1     4
2     5
3     L
4     2
5    12
6    16
7     8
8    XL
dtype: object

In [247]:
def to_num(x):
    try:
        out = float(x)
    except:
        out = np.nan
    return out

In [248]:
sizes.apply(to_num)

0     8.0
1     4.0
2     5.0
3     NaN
4     2.0
5    12.0
6    16.0
7     8.0
8     NaN
dtype: float64

In [176]:
cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [177]:
def describe_car(row):
    efficiency = row['fuel_economy'].lower()
    cyl = row['cyl_word'].lower()
    auto = 'automatic' if row['am'] == 1 else 'manual'
    print(f"This {cyl} cylinder car has {auto} transmission and a(n) {efficiency} fuel economy.")

In [179]:
try:
    cars.head().apply(describe_car, axis=1)
except:
    print("IDK why this doesn't work.")

IDK why this doesn't work.

BONUS QUESTION: Why are there 5 "None" valus in the above output?

## Assign

Dewa is putting this here because he learned it later and found it helpful and... where else? 

You can create a new column as a function of your dataframe.

In [204]:
diamonds.assign(new_col = 1, new_col2 = "constant").head()

,carat,cut,color,clarity,depth,table,price,x,y,z,new_col,new_col2
0,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43,1,constant
1,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31,1,constant
2,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31,1,constant
3,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63,1,constant
4,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75,1,constant

In [188]:
diamonds.assign( 
    x_by_y = lambda df: df['x']/df['y']
).head()

,carat,cut,color,clarity,depth,table,price,x,y,z,x_by_y
0,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43,0.992462
1,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31,1.013021
2,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31,0.995086
3,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63,0.992908
4,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75,0.997701

This slick assignment gives the mean value for a category to each row from that category.

In [193]:
diamonds.assign( 
    mean_x = lambda df: (df.groupby("cut")['x'].transform("mean"))
).sort_values(by="cut")

,carat,cut,color,clarity,depth,table,price,x,y,z,average_x
4654,1.00,Fair,F,SI1,66.7,57.0,3669,6.07,5.99,4.02,6.246894
53338,1.20,Fair,G,I1,64.4,55.0,2655,6.77,6.61,4.31,6.246894
40890,0.50,Fair,E,SI1,65.0,58.0,1176,4.98,4.90,3.21,6.246894
9129,0.90,Fair,F,VS2,59.5,67.0,4536,6.29,6.24,3.73,6.246894
18544,1.50,Fair,E,SI2,69.6,62.0,7560,6.88,6.79,4.76,6.246894
...,...,...,...,...,...,...,...,...,...,...,...
29314,0.31,Ideal,H,VS1,62.0,54.0,698,4.39,4.35,2.71,5.507451
29309,0.34,Ideal,F,SI2,61.9,57.0,438,4.50,4.52,2.79,5.507451
29308,0.25,Ideal,G,VS1,62.7,54.0,438,4.05,4.08,2.55,5.507451
29339,0.31,Ideal,G,VS2,59.1,57.0,698,4.48,4.45,2.64,5.507451
53939,0.75,Ideal,D,SI2,62.2,55.0,2757,5.83,5.87,3.64,5.507451